In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn 
np.random.seed(1234567)

In [3]:
df = pd.DataFrame(
    [
        [15, 32, 101],
        [np.nan, 46, 103],
        [np.nan, 500, np.nan],
    ],
    index= ['A', 'B', 'C'],
    columns = ['C1', 'C2', 'C3']
)

In [4]:
df

     C1   C2     C3
A  15.0   32  101.0
B   NaN   46  103.0
C   NaN  500    NaN

In [5]:
df.dropna()

     C1  C2     C3
A  15.0  32  101.0

In [6]:
df.dropna(axis=1)

    C2
A   32
B   46
C  500

In [7]:
df.dropna(axis=1, thresh=2)

    C2     C3
A   32  101.0
B   46  103.0
C  500    NaN

In [9]:
df.fillna(777)

      C1   C2     C3
A   15.0   32  101.0
B  777.0   46  103.0
C  777.0  500  777.0